In [1]:
import pandas as pd
from matplotlib import pyplot as plt

## load the data in the file data/gapminder_lifeexpectancy.xlsx

In [2]:
lifeexp_df = pd.read_excel('gapminder_lifeexpectancy.xlsx')

 ## select a year from the DataFrame

In [3]:
# give meaningful column name to countries
lifeexp_df.rename(columns={'Life expectancy':'Country'}, inplace=True)

In [4]:
lifeexp_200_df = lifeexp_df[ ['Country', 2000] ]
lifeexp_200_df.head()

                 Country  2000
0               Abkhazia   NaN
1            Afghanistan  50.1
2  Akrotiri and Dhekelia   NaN
3                Albania  74.7
4                Algeria  73.3

## load the data in the file data/continents.csv

In [5]:
continents_df = pd.read_csv('continents.csv', sep=';')

## merge both DataFrames

In [34]:
df = pd.merge(left     = lifeexp_200_df,
              right    = continents_df,
              left_on  = 'Country',
              right_on = 'country',
              how      = 'inner')

df.drop(columns=['Country'], inplace=True) # delete duplicate column present after merge
df.head()

   2000 continent      country
0  50.1      Asia  Afghanistan
1  74.7    Europe      Albania
2  73.3    Africa      Algeria
3  83.7    Europe      Andorra
4  52.3    Africa       Angola

## remove all rows with empty values

In [35]:
df.isnull().sum()

2000         6
continent    0
country      0
dtype: int64

In [36]:
df.dropna(inplace=True) # implies axis=0 meaining row-wise; how='any'

In [37]:
df.isnull().sum()

2000         0
continent    0
country      0
dtype: int64

In [38]:
df.isnull().sum().sum() # count of all NaN in all cols and rows

0

In [39]:
df.head()

   2000 continent      country
0  50.1      Asia  Afghanistan
1  74.7    Europe      Albania
2  73.3    Africa      Algeria
3  83.7    Europe      Andorra
4  52.3    Africa       Angola

## print the highest and lowest life expectancy for each continent

In [44]:
df.groupby(['continent']).max()

                       2000         country
continent
Africa                 75.0        Zimbabwe
Asia                   81.0           Yemen
Australia and Oceania  79.8         Vanuatu
Europe                 83.7  United Kingdom
North America          79.2   United States
South America          77.3       Venezuela

In [45]:
df.groupby(['continent']).min()

                       2000              country
continent
Africa                 37.6              Algeria
Asia                   50.1          Afghanistan
Australia and Oceania  57.5            Australia
Europe                 66.5              Albania
North America          58.7  Antigua and Barbuda
South America          64.2            Argentina

## plot the nuunique

In [51]:
df.nunique()

2000         122
continent      6
country      170
dtype: int64